package hw_2;
/*
     Домашнее задание к семинару Unit-тесты (семинары) "Знакомство с тестовыми фреймворками"
     1. Настроить новый проект:
         a). Нужно создать новый проект, со следующей структурой классов (3 отдельных класса):
         b). Настроить тестовую среду
             (создать тестовый класс VehicleTest, пометить папку как Test sources (зеленая папка),
             импортировать необходимые для тестов библиотеки (JUnit, assertJ - все что было на семинаре))
         c). Написать следующие тесты:
             - Проверить, что экземпляр объекта Car также является экземпляром транспортного средства (используя оператор instanceof)
             - Проверить, что объект Car создается с 4-мя колесами
             - Проверить, что объект Motorcycle создается с 2-мя колесами
             - Проверить, что объект Car развивает скорость 60 в режиме тестового вождения (используя метод testDrive())
             - Проверить, что объект Motorcycle развивает скорость 75 в режиме тестового вождения (используя метод testDrive())
             - Проверить, что в режиме парковки (сначала testDrive, потом park, т.е. эмуляция движения транспорта) машина останавливается (speed = 0)
             - Gроверить, что в режиме парковки (сначала testDrive, потом park  т.е эмуляция движения транспорта) мотоцикл останавливается (speed = 0)
    */
public class Main {
    public static void main(String[] args) {


    }
}